Revit 2024 API
SpacingRule.SetLayoutFixedDistance Method
Set the Layout property to FixedDistance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetLayoutFixedDistance(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
Visual Basic
Public Sub SetLayoutFixedDistance ( _
	distance As Double, _
	just As SpacingRuleJustification, _
	gridlinesRotation As Double, _
	offset As Double _
)
Visual C++
public:
void SetLayoutFixedDistance(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
Parameters
distance
Type: System.Double
just
Type: Autodesk.Revit.DB.SpacingRuleJustification
gridlinesRotation
Type: System.Double
offset
Type: System.Double
Remarks
When changing the Layout to FixedDistance, you must also simultaneously set the Distance, Justification, GridlinesRotation, and Offset properties.
See Also
SpacingRule Class
Autodesk.Revit.DB Namespace